# **8 - Querying**

## Importing Libraries

In [193]:
from sqlalchemy import create_engine
import pandas as pd

## Connect to Database

In [194]:
engine = create_engine('postgresql://bryguan:qwertyuiop@localhost:5432/acme')
connection = engine.connect().execution_options(auto_commit = True)

## Queries

### Gross Sales, Sales Volume, Average Order Value

In [195]:
query = '''

SELECT
    sum(total) as gross_sales,
    count(total) as sales_volume,
    sum(total) / count(*) as average_order_value
FROM 
    sales_2;

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

   gross_sales  sales_volume  average_order_value
0       6480.0            97            66.804124

### Gross Sales 2, Sales Volume 2 % Gross Sales 1, Sales Volume 1

In [196]:
query = '''

WITH sales_1_data AS (
    SELECT
        SUM(total) AS gross_sales,
        COUNT(total) AS sales_volume
    FROM 
        sales_1
),
sales_2_data AS (
    SELECT
        SUM(total) AS gross_sales,
        COUNT(total) AS sales_volume
    FROM 
        sales_2
)
SELECT
    CAST(sales_2_data.gross_sales AS DECIMAL) / CAST(sales_1_data.gross_sales AS DECIMAL) AS percent_gross_sales,
    CAST(sales_2_data.sales_volume AS DECIMAL) / CAST(sales_1_data.sales_volume AS DECIMAL) AS percent_sales_volume
FROM
    sales_1_data, sales_2_data;

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

   percent_gross_sales  percent_sales_volume
0             0.000066              0.000063

### Customers

In [197]:
query = '''

SELECT
    COUNT(DISTINCT customer_id) as customers
FROM 
    customers_2;

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

   customers
0         97

### Customers 2 % Customers 1

In [198]:
query = '''

WITH customers_1_data AS (
    SELECT
        COUNT(DISTINCT customer_id) AS customers
    FROM 
        customers_1
),
customers_2_data AS (
    SELECT
        COUNT(DISTINCT customer_id) AS customers
    FROM 
        customers_2
)
SELECT
    CAST(customers_2_data.customers AS DECIMAL) / CAST(customers_1_data.customers AS DECIMAL) AS percent_customers
FROM
    customers_1_data, customers_2_data;

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

   percent_customers
0           0.003121

### Customers by Sales

In [199]:
query = '''

SELECT
    customer_id,
    first_name,
    last_name,
    count(*) as sales
FROM 
    customers_2
GROUP BY
    customer_id, first_name, last_name
ORDER BY
    sales DESC
    
'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

    customer_id first_name   last_name  sales
0     3728916.0      Nissa       Alman      1
1     3728901.0     Freddy     Mumford      1
2     3729246.0      Candy         Ben      1
3     3728534.0      Gayle  MacGarrity      1
4     3729038.0    Antonie    Jakubski      1
..          ...        ...         ...    ...
92    3728812.0     Jerrie     Selland      1
93    3729340.0      Lanni   Pickavant      1
94    3729149.0    Stanton      Guymer      1
95    3728831.0    Aurilia        Sand      1
96    3728427.0     Myrtia     Charlot      1

[97 rows x 4 columns]

### Customers by Quantity

In [200]:
query = '''

SELECT
    customer_id,
    first_name,
    last_name,
    SUM(quantity) as quantity
FROM 
    customers_2
JOIN
    sales_2 ON customers_2.sale_id = sales_2.sale_id
JOIN
    line_items_2 ON sales_2.sale_id = line_items_2.sale_id
GROUP BY
    customer_id, first_name, last_name
ORDER BY
    quantity DESC
    
'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

    customer_id first_name  last_name  quantity
0     3729276.0  Christian     Anyene      12.0
1     3728826.0      Kandy  Littlekit      12.0
2     3728710.0   Matthieu     Cosbey      12.0
3     3728996.0     Hilary       Ofer      11.0
4     3728510.0   Mordecai   Matthius      11.0
..          ...        ...        ...       ...
92    3728404.0   Darrelle   Dohrmann       1.0
93    3729229.0      Amber   Peniello       1.0
94    3729175.0        Kay  Cantopher       1.0
95    3729342.0       Kari     Charon       1.0
96    3729316.0        Lin    Mortell       1.0

[97 rows x 4 columns]

### Units Sold

In [201]:
query = '''

SELECT SUM(quantity) as units_sold
FROM line_items_2;

'''

connection.rollback()
display(pd.read_sql_query(query, connection))

   units_sold
0       540.0

### Units Sold by Product

In [202]:
query = '''

SELECT
    description as product,
    SUM(quantity) as units_sold
FROM
    line_items_2
JOIN
    product_mappings_2 ON line_items_2.product_id = product_mappings_2.product_id
JOIN
    products_1 ON product_mappings_2.product_id_1 = products_1.product_id
GROUP BY
    description
ORDER BY
    units_sold DESC;

'''

connection.rollback()
display(pd.read_sql_query(query, connection))

             product  units_sold
0   Pistachio Salmon       113.0
1   Eggplant Lasagna       107.0
2      Curry Chicken       101.0
3   Teriyaki Chicken        80.0
4  Brocolli Stir Fry        60.0
5    Tilapia Piccata        44.0
6       Spinach Orzo        27.0
7      Chicken Salad         8.0

## Close Connection

In [203]:
connection.close()
engine.dispose()